/*******************************************************************************
* 版权所有 (C)2009,深圳市迅雷网络技术有限公司。
* 系统名称	: 迅雷公共库
* 文件名称	: lock_guard.h
* 内容摘要	: 进一步封装自旋锁、互斥锁和信号量，以防用户使用锁时忘记解锁
* 当前版本	: 1.0
* 作    者	: 王卫华
* 设计日期	: 2009年2月25日
* 修改记录	: 
* 日    期		版    本		修改人 		修改摘要
*******************************************************************************/
/**************************** 条件编译选项和头文件 ****************************/
#ifndef __LOCK_GUARD_H_875857AC_34A3_43ab_BB3F_25DE8443A63D__  
#define __LOCK_GUARD_H_875857AC_34A3_43ab_BB3F_25DE8443A63D__

#include <stdio.h>

XL_WIN32_NAMESPACE_BEGIN(multithread)

/********************************** 常量和宏 **********************************/

/********************************** 数据类型 **********************************/

/********************************** 函数声明 **********************************/

/*********************************** 类定义 ***********************************/
template <class LOCK>
class lock_guard
{
public:    
    lock_guard(LOCK& input_lock)
        :m_lock(input_lock)
    {
        m_lock.lock();
    }
    ~lock_guard()
    {
        m_lock.unlock();
    }
    
private:    
    LOCK&	m_lock;
};

XL_WIN32_NAMESPACE_END(multithread)

#endif // end of __LOCK_GUARD_H_875857AC_34A3_43ab_BB3F_25DE8443A63D__
